import React from 'react'
import About from './About'
import Home from './Home' 
import{Routes, Route} from 'react-router-dom'
import Navii from './Navii'

const App = () => {
  
  return(
    <div>
      <Navii/>
        <Routes>
          <Route path='/home' element={<Home/>}/>
          <Route path='/about' element ={<About/>}/>
        </Routes>
    </div>
  )
}

export default App





//კომენტარების გამოყენებით ახსენით თუ რა არის react router და რა თანმიმდევრობით უნდა შევქმნათ პროგრამა, რომ იგი სწორად იმუშაოს.

  //რეაქთ როუტერი არის jsx ის ან რეაქტის ხელსაწყო, რომელიც გვეხმარება იმისთვის რომ მოვახდინოთ რამდენიმე გვერდის დაკავშირება და გავაკეთოთ მრავალგვერდიანი ვებსაიტი, ჩვენ თუ გვინდა რომ ჩვენმა როუტერმა სწორად იმუშაოს, ამისათვის ჩვენ დაგვჭირდება რამდენიმე ელემენტის დაიმპორტება ჩვენს რეაქთში, main.jsx ჩვენ ვიწყებთ BrowserRouter დაიმპორტება, შემდეგ უკვე App jsx ში სადაც ვაიმპორტებთ ჩვენს კომპონენტებს, დაგვჭირდება რომ დავაიმპორტორთ Routers და Route ბიბლიოთეკიდან, Route ს გადაეცემა ორი ატრიბუტი path და ელემენტი, path ში ვწერთ კომპონენტის მისამართს, ხოლო elementში ვწერთ თვითონ კომპონენტს, ამით ჩვენ კომპონენტს ვაჩვენებთ თუ რა მიმართულებით უნდა წავიდეს ჩვენი როუტერი და რომელი გვერდი უნდა გახსნას, შემდეგია Link დაიმპორტება ბიბლიოთეკიდან, სადაც იწერება ზუსტად იგივე ფაილის მისამართი რაც Route თეგის ატრიბუტ path ში იწერება, ეს ორი მისამართი თუ ერთმანეთს არ ემთხვევა, როუტერი თავის მოვალეობას ვერ შეასრულებს.