import React, { useState } from 'react'

const App = () => {
  
  //1. კაუჭი არის რეაქთში ჩაშენებული ფუნქცია რომელიც ჩვენს კოდს ამარტივებს და აძლევს სუპერძალებს
  //2. კაუჭები შეიქმნა იმისთვის, რომ ჩვენს კოდი მეტად სწრაფი, ეფექტური და მოკლე გაგვეხადა, კომპონენტებს არ შეეძლოთ მდგომარეობებზე მუშაობა და ინფორმაციების დამახსოვრება კაუჭებამდე
  //3. კაუჭებს ვიყენებთ თითქმის ყოველთვის, კაუჭებს შეუძლიათ შექმნან მდგომარეობები, რომლებიც დაიმახსოვრებენ გარკვეული სახის ინფორმაციას, ასევე იგი გამოიყენება API სთან სასაუბროდ ამიტომ კაუჭების გამოყენება ერთ ერთი მთავარი ნაწილია react ში
  //4. useState არის მდგომარეობის კაუჭი რომელსაც აქვს მდგომარეობა და მდგომარეობის შემცვლელი ფუნქციები
  //5. useState ს გამოყენება არის საჭირო რადგან კომპონენტში შეგვიძლია შევქმნათ მუშა მდგომარეობა

  const [count, setCount] = useState(0);
  

  return(
    <div>
      <div>
        <p>Number is: {count}</p>
        <button onClick={() => setCount(count + 1)}>+1</button>
        <button onClick={() => setCount(count - 1)}>-1</button>
        <button onClick={() => setCount(0)}>Reset it Nigga</button>
      </div>
      
    </div>
  )
}

export default App