import React from 'react'

const App = () => {
  //1. container component არის კომპონენტი სადაც ვწერთ უშუალოდ ლოგიკას ჩვენი კომპონენტის, ფუნქციებს და ასე შემდეგ
  //2. presentational component უშალოდ გამოიყენება რომ გავაკეთოთ layout მაგალითად დიზაინი tailwimnd css და დავარენდეროთ საიტზე ჩვენი პროგრამა, ასე რომ ვთქვათ საჩვენებელი კომპონენტია სადაც ჩონჩხი იგება ფუნქციებისთვის
  //3. container component ინახავს მნიშვნელობას და presentational component ში იგზავნება ეს მნიშვნელობა რომ გამოვიტანოთ ეკრანზე, ასევე container ში იწერება საიტის და უშუალოდ საიტის ჩონჩხის ლოგიკა, ხოლო presentational ზე ვაჩვენებთ ყველაფერს
  //4. დადებითი მხარე არის ის რომ ყველაფერი ორგანიზირებულია და დალაგებული ფაილებში, ხოლო უარყოფითი შეიძლება იყოს ბევრი ფაილები, ბევრი ფაილები ხელს გიშლის დროის დაზოგვაში.
}

export default App